<style  type="text/css">
cool {
  width: 100px;
  height: 100px;
  background-color: red;
  position: relative;
  -webkit-animation-name: example; /* Safari 4.0 - 8.0 */
  -webkit-animation-duration: 4s; /* Safari 4.0 - 8.0 */
  -webkit-animation-iteration-count: infinite; /* Safari 4.0 - 8.0 */
  animation-name: example;
  animation-duration: 4s;
  animation-iteration-count: infinite;
}

loud {
    font-size: 20pt;
    }

/* Safari 4.0 - 8.0 */
@-webkit-keyframes example {
  0%   {background-color:red; left:0px; top:0px;}
  25%  {background-color:yellow; left:200px; top:0px;}
  50%  {background-color:blue; left:200px; top:200px;}
  75%  {background-color:green; left:0px; top:200px;}
  100% {background-color:red; left:0px; top:0px;}
}

/* Standard syntax */
@keyframes example {
  0%   {background-color:red; left:0px; top:0px;}
  25%  {background-color:yellow; left:200px; top:0px;}
  50%  {background-color:blue; left:200px; top:200px;}
  75%  {background-color:green; left:0px; top:200px;}
  100% {background-color:red; left:0px; top:0px;}
}
</style>

<b><center>
<span style="font-size: 24pt; line-height: 1.2">
COMS W4111: Introduction to Databases<br>
Spring 2024, Sections 002/V02
</span>
</center></b>
<br>
<p>
<i><center>
<span style="font-size: 20pt; line-height: 1.2">
Midterm
</span>
</center></i>

# Introduction

This notebook contains the midterm. **Both Programming and Nonprogramming tracks should complete this.** To ensure everything runs as expected, work on this notebook in Jupyter.

- You may post **privately** on Edstem or attend OH for clarification
    - TAs will not be providing hints

Submission instructions:

* You will submit **PDF and ZIP files** for this assignment. Gradescope will have two separate assignments for these.
* For the PDF:
    * The most reliable way to save as PDF is to go to your browser's menu bar and click `File -> Print`. Switch the orientation to landscape mode, and hit save.
    * **MAKE SURE ALL YOUR WORK (CODE AND SCREENSHOTS) IS VISIBLE ON THE PDF. YOU WILL NOT GET CREDIT IF ANYTHING IS CUT OFF.** Reach out for troubleshooting.
* For the ZIP:
    * Zip a folder containing this notebook and any screenshots.
* Further submission instructions may be posted on Edstem.

<hr style="height:2px;">

# Setup

In [2]:
%load_ext sql
%sql mysql+pymysql://root:dbuserdbuser@localhost

In [22]:
import pandas
from sqlalchemy import create_engine
engine = create_engine("mysql+pymysql://root:dbuserdbuser@localhost")

<hr style="height:2px;">

# Written

- You may use lecture notes, slides, and the textbook
- You may use external resources, but you must cite your sources
- As usual, keep things short

## W1

Briefly explain structured data, semi-structured data, and unstructured data. Give an example of each type of data.

_Answer:_ 
Structured data is highly organized and formatted in a way that is easily searchable in databases. It is based on relational table and adheres to a robust schema, meaning it is organized into tables with rows and columns, where each column has a specific data type and the rows collectively represent a record. This type of data is easy to enter, query, and analyze using standard tools and methods, such as SQL.

Semi-structured data does not reside in a relational database but still has some organizational properties that make it easier to analyze than unstructured data. It doesn't fit neatly into tables, rows, and columns but contains tags or other markers to separate semantic elements and enforce hierarchies of records and fields within the data. The semi-structured data model permits the specification of data where individual data items of the same type may have different sets of attributes, which contrast structure data model. JSON and XML are widely used semi-structured data representations.

Unstructured data is information that does not adhere to a predefined data model or is not organized in a predefined manner. It is the most common form of data found in the real world and mostly includes text but other data such as images, videos, and audio. Unstructured data is typically stored in formats that are difficult to process and analyze without advanced tools or techniques. Examples include PDF documents, text, emails, etc. Analyzing such data often requires advanced techniques such as image analysis techniques, et natural language processing, etc.

## W2

Codd's 0th rule states:

    For any system that is advertised as, or claimed to be, a relational database management system, that system must be able to manage databases entirely through its relational capabilities.
    
Briefly explain and give examples of how the rule applied to:

1. Metadata
2. Security

_Answer:_ Codd's 0th rule implies that everything within the database, including its structure, operations, and constraints, should be managed and accessible through the same relational model that manages the data. This ensures uniformity and integrity in how databases are handled, emphasizing the relational capabilities as the fundamental mechanism for all database operations. 
1. Metadata: The information about tables, columns, constraints, and indexes should be stored in system tables within the database itself. The rule dictates that metadata operations, like querying table schemas or altering constraints, are performed through standard relational operatons rather than other mechanisms. This is the reason the Information Schema is part of the ANSI SQL standards, which provides read-only views about the metadata.
2. Security: The database management system should enforce access controls, user permissions, and data encryption using its inherent relational capabilities. For instance, user authentication and authorization can be managed through relational tables storing user credentials and permissions. Access control mechanisms, such as granting or revoking privileges on tables and views, should be implemented using standard SQL commands. Encryption of sensitive data can be achieved through relational techniques such as column-level encryption or using relational encryption functions provided by the RDBMS.

## W3

Codd's 6th rule states:

    All views that are theoretically updatable are also updatable by the system.
    
Using the following table definition, use SQL (`create view`) to define

    1. Two views of the table that are not possible to update
    2. One view that is possible to update
    
You do not need to execute the statements. We are focusing on your understanding.

```
create table student
(
    social_security_no char(9) not null primary key,
    last_name varchar(64) null,
    first_name varchar(64) null,
    enrollment_year year null,
    total_credits int null
);
```

_Answer:_ 
1. If the view uses some transformation that makes it impossible to uniquely map the updated values back to the original columns, then it is not theoretically updatable, so it won't be possible to update. One example is

CREATE VIEW student_full_name AS
SELECT social_security_no, CONCAT(first_name, ' ', last_name) AS full_name
FROM student;

Another example is

CREATE VIEW yearly_credits AS
SELECT enrollment_year, COUNT(social_security_no) AS number_of_students, SUM(total_credits) AS credits_sum
FROM student
GROUP BY enrollment_year;

The first example uses CONCAT, which makes it no longer clear how to map the full_name back into first_name and last_name. The second example aggregates students by their enrollment year, showing the number of students in that year and the total sum of their credits per year. Since it summarizes data across multiple rows, it's not clear which rows should be modified to reflect an update to this view. Therefore, in both cases, the views are not posible to update.

2. For example, if a view simply takes a subset of the columns of the original table, it maintains a clear mapping to the underlying data, so it can be updated. For example,

CREATE VIEW student_total_credit AS
SELECT social_security_no, total_credits
FROM student;

would be possible to update. It simply takes some of the columns, so it does not apply any transformations that obscure the origin of the data. Thus, updates to this view are possible as the view can be mapped back to the original table.

## W4

The Columbia University directory of courses uses `20241COMS4111W002` for this sections "key".

1. Is this key atomic? Explain.
2. Explain why having non-atomic keys creates problems for indexes.

_Answer:_ No, this key is not atomic as it can be divided into smaller components, such as "2024" as the year of the course, "COMS" as the department name, and "002" as the section number. Having non-atomic keys creates problems for indexes. The data retrieval could possibly be slow despite the index; if the queries often involve only one part of the non-atomic key, such as the section number here, then the index on the entire non-atomic would not efficiently speed up the data retrieval, compared to an index directly on the section number. Also, when parts of a non-atomic key change, the index may need to be updated. If only a portion of a non-atomic key is modified, such as the section number, the index entries for all the related data need to be updated, which can be complex and time-consuming. In general, it's harder to adapt indexes to changes in data structure when non-atomic keys are used.

## W5

Briefly explain the following concepts:

1. Natural join
2. Equi-join
3. Theta join
4. Left join
5. Right join
6. Outer join
7. Inner join

_Answer:_
1. Natural join: A natural join is an operation in relational databases that automatically matches and joins tables based on columns with the same names, outputting all pairs of rows from the two tables that have equal values in all matched columns. It removes the duplicate columns involved in the comparison, only keeping one of each compared column.
2. Equi-join: An equi-join is a particular type of theta join where the join condition is based on equality between specified columns in the two tables. It returns only the rows that have equivalent values for the specified columns. Unlike natural joins, equi-joins require specifying the column names explicitly in the join condition.
3. Theta join: A theta join is a generalized join that allows for any conditional expression in the join condition. Unlike equi-join, which only allows equality ('=') operator, theta join allows for any operator.
4. Left join: A left join outputs all rows from the left table, and the matched rows from the right table. If there is no match, the result becomes NULL on the side of the right table for that row.
5. Right join: This is the opposite of left join. A right join outputs all rows from the right table, and the matched rows from the left table. If there is no match, the result becomes NULL on the side of the left table for that row.
6. Outer join: An outer join is essentially the union of the outputs of both left and right joins. It returns all rows from both tables, with matching rows from both sides where available. If there is no match in either side, the missing side will be filled with NULLs.
7. Inner join: An inner join combines rows from two tables, returning only those rows where there is a match found in both tables based on some join condition. The join condition is explicitly specified, unlike in a Natural Join. Inner join can be considered as the default join type in SQL.

## W6

The _Classic Models_ database has several foreign key constraints. For instance, _orderdetails.orderNumber_ references _orders.orderNumber_.

1. Briefly explain the concept of _cascading actions_ relative to foreign keys.
2. How could cascading actions be helpful for the above foreign key relationship?

_Answer:_ 
1. Cascading actions in the context of foreign key constraints refer to the automatic triggering of updates or deletions across related tables (children of the referenced parent table) when a change is made to a row in referenced table. These actions ensure data integrity and consistency across the relational database. Instead of cascade, one could also use "set null" (which sets the values in the foreign key columns of the children tables null) or "set default" (which sets them to some specified default value).
2. Cascading actions can be helpful for the foreign key relationship between _orderdetails.orderNumber_ and _orders.orderNumber_. If an order is cancelled/deleted from the orders table, cascading delete actions can automatically remove all associated order details from the orderdetails table, ensuring that the database does not keep any details of a non-existent order. Or, if an order's number changes for some reason (although it would be unlikely for a primary key to changed), a cascading update action would ensure that all related entries in the orderdetails table are also updated. These cascading actions can simplify the maintenance of database integrity, by automating the update and delete operations across related tables, eliminating the possibility of human error originating from manual maintenance.

## W7

Give two reasons for using an associative entity to implement a relationship instead of a foreign key.

_Answer:_ Here are the two reasons why using associative entities to implement a relationship would be necessary or advantageous compared to only using foreign keys:
1. A direct many-to-many relationship cannot be efficiently implemented using only foreign keys because a single record in one table cannot reference multiple records in another table without duplicating data. An associative entity works as a bridge between the two tables, allowing each record in one table to be linked to multiple records in the other table by instances of that associative entity. For example, the entities "Researchers" and "Projects" may be connected through an associative entity because each researcher can be in multiple projects and each project can have multiple researchers.
2. For some relationships, there could be a need to store information about the relationship itself, not just about the entities being linked. An associative entity can be used to store such attributes effectively. For example, the "Advisor-Advisee" associative entity linking "Students" and "Teachers" may store additional information about the advisor-advisee relationship such as the date the advisor teacher started advising the student or the particular topic of advising. These attributes are specific to the relationship between an advisee student and advisor teacher and do not belong to either the Students or Teachers table alone, which is why we use an associative entity to hold this relationship-specific information in a organized and easily retrievable way.

## W8

Briefly explain how SQL is closed under its operations. Give a simple query that takes advantage of this.

_Answer:_ The fact that SQL is closed under its operation means that the output of any SQL operation is a table, which can then be used as the input for another SQL operation. In other words, each operation takes one or more tables as input and produces a new table as output, which enables complex queries and data manipulations through the nested/iterative application of operations. Here is a simple example:

SELECT 
    productCode,
    productName,
    productLine,
    buyPrice
FROM 
    (SELECT *
     FROM products
     WHERE productLine = 'Classic Cars') AS firstTable
ORDER BY buyPrice DESC
LIMIT 5;

Here, the inner query is used as the input for the outer query, demonstrating that the result of the inner query is another table, which is enabled by the closure property.

## W9

Briefly explain the differences between:

1. Database stored procedures
2. Database functions
3. Database triggers

_Answer:_ 
Procedures and functions enable “business logic” to be stored in the database and executed from SQL statements.

1. Database stored procedures are sets of SQL statements that are stored and executed on the database server. They can handle complex operations, such as data manipulation and transaction management. They are able to take "in" and "out" keywords as parameters that are expected to have values assigned to them and parameters whose values are set in the procedure in order to return results. A procedure can be used to both read and modify data and may or may not return a value. They are used for data validation, complex business logic implementation, etc.

2. Database functions are similar to stored procedures in that they encapsulate SQL code for reuse, but they are designed to return a single value or a table based on at least one parameter as input. The can only read data but not modify data. One can execute a function inside a stored procedure, but one cannot execute a stored procedure from a function. They are usually used for data formatting, calculations, and basic data retrieval operations.

3. Database trigger is a statement that is executed automatically by the system as a side effect of a modification to the database. One must 1) specify the conditions under which the trigger is to be executed and 2) specify the actions to be taken when the trigger executes to design a trigger mechanism. They can change data and have no return value. They are often used to trigger custom actions to specific changes, automatically update audit logs, enforcing complex integrity constraints, etc.

## W10

List three benefits/use cases for defining views.

_Answer:_ Here are the three benefits/use cases for defining views:
1. Views abstract complex queries into a simpler form. One a view is defined, the user can access it any time and further manipulate it without having to rewrite all the querying that the view already implemented before. Therefore, views are helpful in accessing the results of complex queries in an abstracted way, and without even using extra space.

2. Views can function as a way to restrict access to specific subsets of data, which provides security. The database administrator is able to only expose a certain part of the data by creating a view and keeping other sensitive data hidden. For example, a view can be used to remove a column for SSN number for some table, making sure the users cannot access the SSN numbers of other people, which maintains security.

3. Views can be also used provide personalized or customized to fit the particular needs of different type of users or applications. For example, the marketing department may utilize a view that highlights campaign performance and customer engagement metrics, whereas the finance team might access a different view that brings together budget allocations and expenses. This tailored approach makes analyzing data more efficient because users can focus on the most relevant information for their purposes.

<hr style="height:2px;">

# Relational Algebra

- Use the [Relax calculator](https://dbis-uibk.github.io/relax/calc/gist/4f7866c17624ca9dfa85ed2482078be8/relax-silberschatz-english.txt/0) for these questions.
- For each question, you need to show your algebra statement and a screenshot of your tree and output.
    - **For your screenshot, make sure the entire tree and output are shown.** You may need to zoom out.
- The suggestions on which relations to use are hints, not requirements.

## R1

- Write a relational algebra statement that produces a relation showing **teachers that taught sections in buildings that didn't match their department's building**.
    - A section is identified by `(course_id, sec_id, semester, year)`.
- Your output should have the following columns (names should match exactly; there should be no prefixes):
    - `instructor_name`
    - `instructor_dept`
    - `course_id`
    - `sec_id`
    - `semester`
    - `year`
    - `course_building`
    - `dept_building`
- You should use the `teaches`, `section`, `instructor`, and `department` relations.


- As an example, one row you should get is

| instructor_name | instructor_dept | course_id | sec_id | semester | year | course_building | dept_building |
|-----------------|-----------------|-----------|--------|----------|------|-----------------|---------------|
| 'Srinivasan'    | 'Comp. Sci.'    | 'CS-101'  | 1      | 'Fall'   | 2009 | 'Packard'       | 'Taylor'      |

- Srinivasan taught CS-101, section 1 in Fall of 2009 in the Packard building. However, Srinivasan is in the CS department, whose building is Taylor.

Algebra statement:

```
table_one = instructor ⨝ (teaches ⨝ section)

table_two = π instructor.ID, department.building (instructor ⨝ department)

table_three = table_one ▷ table_two

table = (π instructor.ID, instructor.name → instructor_name, instructor.dept_name → instructor_dept, teaches.course_id → course_id, teaches.sec_id → sec_id, teaches.semester → semester, teaches.year → year, section.building → course_building table_three) ⨝ table_two

π instructor_name, instructor_dept, course_id, sec_id, semester, year, course_building, department.building → dept_building table
```

Execution:

| <img src="./R1-sample.png"> |
| :---: |
| __R1 Execution Result__|

## R2

- Some students don't have instructor advisors. Some instructors don't have student advisees.
- Write a relational algebra statement that produces a relation showing **valid pairing between unadvised students and instructors with no advisees**.
    - A pairing is valid only if the student's department and instructor's department match.
- Your output should have the following columns (names should match exactly; there should be no prefixes):
    - `instructor_name`
    - `student_name`
    - `dept_name`
- You should use the `advisor`, `student`, and `instructor` relations.
- **You may only use the following operators:** π, σ, =, ≠, ∧ (and), ∨ (or), ρ, ←, ⨝, ⟕, ⟖, ⟗
    - You may not need to use all of them.
    - Notably, you may **not** use anti-join or set difference.
    

- As an example, one row you should get is

| instructor_name | student_name | dept_name |
|-----------------|--------------|-----------|
| 'El Said'       | 'Brandt'     | 'History' |

- El Said has no advisees, and Brandt has no advisor. They are both in the history department.
- The same instructor may show up multiple times, but the student should be different each time. Similarly, the same student may show up multiple times, but the instructor should be different each time.

Algebra statement:

```
advised_students = π advisor.s_id → student_ID, i_id advisor
students = π student.ID → student_ID, dept_name, name student
unadvised_students = π student_ID, dept_name → dept_name, name → student_name(σ advisor.i_id=null (advised_students ⟖ students))

advising_instructors = π advisor.i_id → instructor_ID, s_id advisor
instructors = π instructor.ID → instructor_ID, dept_name, name instructor
unadvising_instructors = π instructor_ID, dept_name → dept_name, name → instructor_name (σ advisor.s_id=null (advising_instructors ⟖ instructors))

π instructor_name, student_name, dept_name (unadvising_instructors ⨝ unadvised_students)
```

Execution:

| <img src="./R2-newsample.png"> |
| :---: |
| __R1 Execution Result__|

## R3

- Consider `new_section`, defined as:

```
new_section = π course_id, sec_id, building, room_number, time_slot_id (section)
```

- `new_section` contains sections, their time assignments, and room assignments independent of year and semester.
    - For this question, you can assume all the sections listed in `new_section` occur in the same year and semester.
- Write a relational algebra statement that produces a relation showing **conflicting sections**.
    - Two sections conflict if they have the same `(building, room_number, time_slot_id)`.
- Your output should have the following columns (names should match exactly; there should be no prefixes):
    - `first_course_id`
    - `first_sec_id`
    - `second_course_id`
    - `second_sec_id`
    - `building`
    - `room_number`
    - `time_slot_id`
- Your output cannot include courses and sections that conflict with themselves, or have two rows that show the same conflict.


- Good news: I'm going to give you the correct output!

| first_course_id | first_sec_id | second_course_id | second_sec_id | building | room_number | time_slot_id |
|-----------------|--------------|------------------|---------------|----------|-------------|--------------|
| 'CS-190'        | 2            | 'CS-347'         | 1             | 'Taylor' | 3128        | 'A'          |
| 'CS-319'        | 2            | 'EE-181'         | 1             | 'Taylor' | 3128        | 'C'          |

- Bad news: Your output must match mine **exactly**. The order of `first_course_id` and `second_course_id` cannot be switched.
    - Hint: You can do string comparisons in Relax using the inequality operators.

Algebra statement:

```
new_section = π course_id, sec_id, building, room_number, time_slot_id (section)
first_section = π course_id → first_course_id, sec_id → first_sec_id, building → building, room_number → room_number, time_slot_id → time_slot_id new_section
second_section = π course_id → second_course_id, sec_id → second_sec_id, building → building, room_number → room_number, time_slot_id → time_slot_id new_section

preprocessed = π first_course_id, first_sec_id, second_course_id, second_sec_id, building, room_number, time_slot_id (first_section ⨝ second_section)

σ first_course_id ≤ second_course_id ∧ first_course_id ≠ second_course_id preprocessed
```

Execution:

| <img src="./R3-sample.png"> |
| :---: |
| __R1 Execution Result__|

<hr style="height:2px;">

# ER Modeling

## Definition to Model

- You're in charge of creating a model for a new music app, Dotify.


- The model has the following entities:
    1. `Artist` has the properties:
        - artist_id (primary key)
        - name
        - description
        - date_joined
    2. `Album` has the properties:
        - album_id (primary key)
        - name
        - release_date
    3. `Song` has the properties:
        - song_id (primary key)
        - title
        - song_length
        - number_of_plays
    4. `User` has the properties:
        - user_id (primary key)
        - name
        - bio
        - date_joined
    5. `Review` has the properties:
        - review_id (primary key)
        - number_of_stars
        - review_text
    6. `Playlist` has the properties:
        - playlist_id (primary key)
        - name
        - description
        
        
- The model has the following relationships:
    1. `Artist-Album`: An artist can have any number of albums. An album belongs to one artist.
    2. `Album-Song`: An album can have at least one song. A song is on exactly one album.
    3. `Artist-Song`: An artist can have any number of songs. A song has at least one artist.
    4. `Album-Review`: An album can have any number of reviews. A review is associated with exactly one album.
    5. `User-Review`: A user can write any number of reviews. A review is associated with exactly one user.
    6. `User-Playlist`: A user can have any number of playlists. A playlist belongs to exactly one user.
    7. `Song-Playlist`: A song can be on any number of playlists. A playlist contains at least one song.
    
    
- Other requirements:
    1. You may **only** use the [four Crow's Foot](https://www.inf.usi.ch/faculty/soule/teaching/2014-spring/2014-03-07/images/crows-feet-notation.png) notations shown in class.
    2. A user can leave at most one review per album (you don't need to represent this in your diagram). However, reviews can change over time. Your model must support the ability to keep track of a user's current and previous reviews for an album as well as the dates for the reviews.
    3. Playlists can change over time. Your model must support the ability to keep track of current songs in a playlist as well as which songs were on a playlist for what date ranges.
    4. You may not directly link many-to-many relationships. You must use an associative entity.
    5. You may (and should) add attributes to the entities and create new entities to fulfill the requirements. **Do not forget about foreign keys.**
    6. You may add notes to explain any reasonable assumptions you make, either on the Lucidchart or below.
        - It would be beneficial, for instance, to document how you implemented requirements 2 and 3.

_Assumptions and Documentation_
- The add_date attribute for "Song in Playlist" refers to the most recent add date of that song to the playlist. Also, if some song is no longer in the playlist, then the remove_date attribute refers to the most recent remove date of that song.
- My other assumptions and documentation are on the Lucidchart.

Diagram:

| <img src="./lucidchart.png"> |
| :---: |
| __Definition to Model ER Diagram__|

## Model to DDL

- This question tests your ability to convert an ER diagram to DDL.
- Given the ER diagram below, write `create table` statements to implement the model.
    - You should choose appropriate data types, nullness, etc.
    - **You are required to implement the assumptions shown in the diagram.** You can document your other assumptions.
    - You don't need to execute your statements. You also don't need to worry about details like creating/using a database.
    
| <img src="./model-to-sql.png"> |
| :---: |
| __Model to DDL ER Diagram__|

Answer:

_Assumptions and Documentation_
- I assumed that crew_position and travel_class cannot be null.
- I assumed that all other attributes, other than primary keys and "start_date" of Crew Member, can be NULL, even though in practice most of them would not.

```
create table Airline (
    airline_id INT PRIMARY KEY,
    airline_iata CHAR(2),
    airline_icao CHAR(3),
    airline_name VARCHAR(255),
    active BOOLEAN,
    airline_country VARCHAR(255),
    CONSTRAINT check_airline_iata_length CHECK (CHAR_LENGTH(airline_iata) = 2),
    CONSTRAINT check_airline_icao_length CHECK (CHAR_LENGTH(airline_icao) = 3)
);

create table Airplane (
    airplane_tail_no VARCHAR(255) PRIMARY KEY,
    airplane_manufacturer VARCHAR(255),
    airplane_model VARCHAR(255),
    airplane_country_of_origin VARCHAR(255),
    capacity INT,
    airplane_owner_airline_id INT,
    FOREIGN KEY (airplane_owner_airline_id) REFERENCES Airline(airline_id)
);

create table Airport (
    airport_id INT PRIMARY KEY,
    airport_iata CHAR(3),
    airport_icao CHAR(4),
    airport_name VARCHAR(255),
    airport_country VARCHAR(255),
    CONSTRAINT check_airport_iata_length CHECK (CHAR_LENGTH(airport_iata) = 3),
    CONSTRAINT check_airport_icao_length CHECK (CHAR_LENGTH(airport_icao) = 4)
);

create table Flight (
    airline_id INT,
    flight_no VARCHAR(255),
    departure_airport INT,
    arrival_airport INT,
    departure_datetime DATETIME,
    arrival_datetime DATETIME,
    airplane_id VARCHAR(255),
    PRIMARY KEY (airline_id, flight_no),
    FOREIGN KEY (airline_id) REFERENCES Airline(airline_id),
    FOREIGN KEY (departure_airport) REFERENCES Airport(airport_id),
    FOREIGN KEY (arrival_airport) REFERENCES Airport(airport_id),
    FOREIGN KEY (airplane_id) REFERENCES Airplane(airplane_tail_no)
);


CREATE TABLE CrewMember (
    pilot_id INT PRIMARY KEY,
    employer_airline_id INT,
    first_name VARCHAR(255),
    last_name VARCHAR(255),
    birthdate DATE,
    country_of_origin VARCHAR(255),
    passport_no VARCHAR(255),
    start_date DATE NOT NULL,
    end_date DATE,
    FOREIGN KEY (employer_airline_id) REFERENCES Airline(airline_id)
);


CREATE TABLE CrewMemberFlight (
    pilot_id INT,
    airline_id INT,
    flight_no VARCHAR(255),
    crew_position ENUM('pilot', 'copilot', 'flight engineer', 'navigator') NOT NULL,
    PRIMARY KEY (pilot_id, airline_id, flight_no),
    FOREIGN KEY (pilot_id) REFERENCES CrewMember(pilot_id),
    FOREIGN KEY (airline_id) REFERENCES Flight(airline_id),
    FOREIGN KEY (flight_no) REFERENCES Flight(flight_no)
);


CREATE TABLE Passenger (
    passenger_id INT PRIMARY KEY,
    first_name VARCHAR(255),
    last_name VARCHAR(255),
    birthdate DATE,
    country_of_origin VARCHAR(255),
    passport_no VARCHAR(255)
);


CREATE TABLE PassengerFlight (
    passenger_id INT,
    airline_id INT,
    flight_no VARCHAR(255),
    travel_class ENUM('First', 'Business', 'Economy') NOT NULL,
    seat_no VARCHAR(255),
    on_flight BOOLEAN,
    PRIMARY KEY (passenger_id, airline_id, flight_no),
    FOREIGN KEY (passenger_id) REFERENCES Passenger(passenger_id),
    FOREIGN KEY (airline_id) REFERENCES Flight(airline_id),
    FOREIGN KEY (flight_no) REFERENCES Flight(flight_no)
);

```

<hr style="height:2px;">

# Data and Schema Cleanup

## Setup

- There are several issues with the `classicmodels` schema. Two issues are:
    - Having programs or users enter country names for `customers.country` is prone to error.
    - `products.productCode` is clearly not an atomic value.
    

- The following code does the following:
    1. Creates a schema for this question
    2. Creates copies of `classicmodels.customers` and `classicmodels.products`
    3. Loads a table of [ISO country codes](https://en.wikipedia.org/wiki/List_of_ISO_3166_country_codes)

In [3]:
%%sql

drop schema if exists classicmodels_midterm;
create schema classicmodels_midterm;
use classicmodels_midterm;

create table customers as select * from classicmodels.customers;
create table products as select * from classicmodels.products;

 * mysql+pymysql://root:***@localhost
4 rows affected.
1 rows affected.
0 rows affected.
122 rows affected.
110 rows affected.

[]

In [4]:
iso_df = pandas.read_csv('./wikipedia-iso-country-codes.csv')
iso_df.to_sql('countries', schema='classicmodels_midterm', 
              con=engine, index=False, if_exists="replace")

246

In [5]:
%%sql

alter table countries
    change `English short name lower case` short_name varchar(64) null;

alter table countries
    change `Alpha-2 code` alpha_2_code char(2) null;

alter table countries
    change `Alpha-3 code` alpha_3_code char(3) not null;

alter table countries
    change `Numeric code` numeric_code smallint unsigned null;

alter table countries
    change `ISO 3166-2` iso_text char(13) null;
    
alter table countries
    add primary key (alpha_3_code);
    
select * from countries limit 10;

 * mysql+pymysql://root:***@localhost
246 rows affected.
246 rows affected.
246 rows affected.
246 rows affected.
246 rows affected.
0 rows affected.
10 rows affected.

[('Aruba', 'AW', 'ABW', 533, 'ISO 3166-2:AW'),
 ('Afghanistan', 'AF', 'AFG', 4, 'ISO 3166-2:AF'),
 ('Angola', 'AO', 'AGO', 24, 'ISO 3166-2:AO'),
 ('Anguilla', 'AI', 'AIA', 660, 'ISO 3166-2:AI'),
 ('Åland Islands', 'AX', 'ALA', 248, 'ISO 3166-2:AX'),
 ('Albania', 'AL', 'ALB', 8, 'ISO 3166-2:AL'),
 ('Andorra', 'AD', 'AND', 20, 'ISO 3166-2:AD'),
 ('Netherlands Antilles', 'AN', 'ANT', 530, 'ISO 3166-2:AN'),
 ('United Arab Emirates', 'AE', 'ARE', 784, 'ISO 3166-2:AE'),
 ('Argentina', 'AR', 'ARG', 32, 'ISO 3166-2:AR')]

## DE1

- There are four values in `customers.country` that do not appear in `countries.short_name`.
- Write a query that finds these four countries.
    - Hint: Norway should be one of these countries.

In [6]:
%%sql

SELECT distinct customers.country
FROM customers
LEFT JOIN countries ON customers.country = countries.short_name
WHERE countries.short_name IS NULL;

 * mysql+pymysql://root:***@localhost
4 rows affected.

[('USA',), ('Norway  ',), ('UK',), ('Russia',)]

## DE2

- `Norway` actually does appear in `countries.short_name`. The reason it appeared in DE1 is because there's a space after the name (`Norway_` instead of `Norway`).
- The mapping for the other countries is:

| customers.country | countries.short_name |
| :---: | :---: |
| USA | United States |
| UK | United Kingdom |
| Russia | Russian Federation |

- Write `update table` statements to correct the values in `customers.country` so that all the values in that attribute appear in `countries.short_name`.

In [7]:
%%sql

UPDATE customers
SET country = 'Norway'
WHERE country LIKE 'Norway%';


UPDATE customers
SET country = 'United States'
WHERE country = 'USA';


UPDATE customers
SET country = 'United Kingdom'
WHERE country = 'UK';


UPDATE customers
SET country = 'Russian Federation'
WHERE country = 'Russia';

 * mysql+pymysql://root:***@localhost
3 rows affected.
36 rows affected.
5 rows affected.
1 rows affected.

[]

In [8]:
%%sql

SELECT distinct customers.country
FROM customers
LEFT JOIN countries ON customers.country = countries.short_name
WHERE countries.short_name IS NULL;

 * mysql+pymysql://root:***@localhost
0 rows affected.

[]

## DE3

- The PK of `countries` is `alpha_3_code`. We want that as a FK in `customers`.

1. Create a column `customers.iso_code`
2. Set `customers.iso_code` as a FK that references `countries.alpha_3_code`
3. Fill `customers.iso_code` with the appropriate data based on `customers.country`
4. Drop `customers.country`
5. Create a view `customers_country` of form `(customerNumber, customerName, country, iso_code)`

Bonus point: I would ask you to create an index on `customers.iso_code`, but this is actually already done for us. When was an index created on `customers.iso_code`?

_Answer:_ This index was created on `customers.iso_code` in Step 2 when `customers.iso_code` was defined as a foreign key. That is because MySQL automatically creates an index for the foreign key column when a foreign key constraint is defined. The idea is that foreign key constraints require checking the referenced value in the referenced table, so an index allows this check to be quite faster.

In [9]:
%%sql

ALTER TABLE customers
ADD COLUMN iso_code CHAR(3);

ALTER TABLE customers
ADD CONSTRAINT fk_customers_iso_code FOREIGN KEY (iso_code) REFERENCES countries(alpha_3_code);

UPDATE customers
SET iso_code = (
    SELECT alpha_3_code
    FROM countries WHERE short_name = customers.country
);

ALTER TABLE customers
DROP COLUMN country;

CREATE VIEW customers_country AS
SELECT customerNumber,
       customerName,
       (SELECT short_name FROM countries WHERE alpha_3_code = customers.iso_code) AS country,
       iso_code
FROM customers;

 * mysql+pymysql://root:***@localhost
0 rows affected.
122 rows affected.
122 rows affected.
0 rows affected.
0 rows affected.

[]

In [14]:
%%sql
SELECT * FROM customers_country LIMIT 10;

 * mysql+pymysql://root:***@localhost
10 rows affected.

[(103, 'Atelier graphique', 'France', 'FRA'),
 (112, 'Signal Gift Stores', 'United States', 'USA'),
 (114, 'Australian Collectors, Co.', 'Australia', 'AUS'),
 (119, 'La Rochelle Gifts', 'France', 'FRA'),
 (121, 'Baane Mini Imports', 'Norway', 'NOR'),
 (124, 'Mini Gifts Distributors Ltd.', 'United States', 'USA'),
 (125, 'Havel & Zbyszek Co', 'Poland', 'POL'),
 (128, 'Blauer See Auto, Co.', 'Germany', 'DEU'),
 (129, 'Mini Wheels Co.', 'United States', 'USA'),
 (131, 'Land of Toys Inc.', 'United States', 'USA')]

## DE4

- To test your code, output a table that shows the number of customers from each country.
- You should use your `customers_country` view.
- Your table should have the following attributes:
    - `country_iso`
    - `number_of_customers`
- Order your table from greatest to least `number_of_customers`.
- Show only the first 10 rows.

In [15]:
%%sql

SELECT 
    iso_code AS country_iso,
    COUNT(*) AS number_of_customers
FROM 
    customers_country
GROUP BY 
    iso_code
ORDER BY 
    number_of_customers DESC limit 10;

 * mysql+pymysql://root:***@localhost
10 rows affected.

[('USA', 36),
 ('DEU', 13),
 ('FRA', 12),
 ('ESP', 7),
 ('AUS', 5),
 ('GBR', 5),
 ('NZL', 4),
 ('ITA', 4),
 ('NOR', 3),
 ('SGP', 3)]

## DE5

- `products.productCode` appears to be 3 separate values joined by an underscore.
    - I have no idea what the values mean, but let's pretend we do know for the sake of this question.
- Write `alter table` statements to create 3 new columns: `product_code_letter`, `product_code_scale`, and `product_code_number`.
    - Choose appropriate data types. `product_code_letter` should always be a single letter.

In [16]:
%%sql

Select DISTINCT LENGTH(productCode) FROM products limit 50;

 * mysql+pymysql://root:***@localhost
2 rows affected.

[(8,), (9,)]

In [17]:
%%sql

SELECT productCode from products where LENGTH(productCode) > 8;

 * mysql+pymysql://root:***@localhost
12 rows affected.

[('S700_1138',),
 ('S700_1691',),
 ('S700_1938',),
 ('S700_2047',),
 ('S700_2466',),
 ('S700_2610',),
 ('S700_2824',),
 ('S700_2834',),
 ('S700_3167',),
 ('S700_3505',),
 ('S700_3962',),
 ('S700_4002',)]

In [18]:
%%sql
ALTER TABLE products
ADD COLUMN product_code_letter CHAR(1),
ADD COLUMN product_code_scale VARCHAR(3),
ADD COLUMN product_code_number INT;

 * mysql+pymysql://root:***@localhost
0 rows affected.

[]

## DE6

- As an example, for the product code `S18_3856`, the product code letter is `S`, the product code scale is `18`, and the product code number is `3856`.
    - I know the product code scale doesn't always match `products.productScale`. Let's ignore this for now.

1. Populate `product_code_letter`, `product_code_scale`, and `product_code_number` with the appropriate values based on `productCode`.
2. Change the PK of `products` from `productCode` to `(product_code_letter, product_code_scale, product_code_number)`.
3. Drop `productCode`.

In [19]:
%%sql

UPDATE products
SET product_code_letter = LEFT(productCode, 1),
    product_code_scale = SUBSTRING(SUBSTRING_INDEX(productCode, '_', 1), 2),
    product_code_number = CAST(SUBSTRING_INDEX(productCode, '_', -1) AS UNSIGNED);

ALTER TABLE products
ADD PRIMARY KEY (product_code_letter, product_code_scale, product_code_number);

ALTER TABLE products
DROP COLUMN productCode;

 * mysql+pymysql://root:***@localhost
110 rows affected.
0 rows affected.
0 rows affected.

[]

## DE7

- To test your code, output a table that shows the products whose `product_code_scale` doesn't match `productScale`.
- Your table should have the following attributes:
    - `product_code_letter`
    - `product_code_scale`
    - `product_code_number`
    - `productScale`
    - `productName`
- Order your table on `productName`.

In [20]:
%%sql

SELECT 
    product_code_letter,
    product_code_scale,
    product_code_number,
    productScale,
    productName
FROM 
    products
WHERE 
    product_code_scale != SUBSTRING_INDEX(productScale, ':', -1)
ORDER BY 
    productName;

 * mysql+pymysql://root:***@localhost
6 rows affected.

[('S', '24', 3856, '1:18', '1956 Porsche 356A Coupe'),
 ('S', '24', 4620, '1:18', '1961 Chevrolet Impala'),
 ('S', '12', 3148, '1:18', '1969 Corvair Monza'),
 ('S', '700', 2824, '1:18', '1982 Camaro Z28'),
 ('S', '700', 3167, '1:72', 'F/A 18 Hornet 1/72'),
 ('S', '18', 2581, '1:72', 'P-51-D Mustang')]

<hr style="height:2px;">

# SQL

- Use the `classicmodels` database for these questions.
- The suggestions on which tables to use are hints, not requirements.

In [3]:
%sql use classicmodels

 * mysql+pymysql://root:***@localhost
0 rows affected.

[]

In [15]:
%%sql
SELECT 
    productCode,
    productName,
    productLine,
    buyPrice
FROM 
    (SELECT *
     FROM products
     WHERE productLine = 'Classic Cars') AS firstTable
ORDER BY buyPrice DESC
LIMIT 5;

 * mysql+pymysql://root:***@localhost
5 rows affected.

[('S10_4962', '1962 LanciaA Delta 16V', 'Classic Cars', Decimal('103.42')),
 ('S18_2238', '1998 Chrysler Plymouth Prowler', 'Classic Cars', Decimal('101.51')),
 ('S10_1949', '1952 Alpine Renault 1300', 'Classic Cars', Decimal('98.58')),
 ('S24_3856', '1956 Porsche 356A Coupe', 'Classic Cars', Decimal('98.30')),
 ('S12_1108', '2001 Ferrari Enzo', 'Classic Cars', Decimal('95.59'))]

## SQL1

- Write a query that produces a table of form `(productName, productLine, productVendor, totalRevenue)`.
    - Attribute names should match exactly.
    - The `totalRevenue` for a product is the sum of `quantityOrdered*priceEach` across all the rows the product appears in in `orderdetails`.
    - You should consider all orders, regardless of `orders.status`.
- Only include products with `totalRevenue` greater than $150,000.
- Order your output on `totalRevenue` descending.


- You should use the `products` and `orderdetails` tables.

In [198]:
%%sql

SELECT 
    products.productName, 
    products.productLine, 
    products.productVendor, 
    SUM(od.quantityOrdered * od.priceEach) AS totalRevenue
FROM 
    products
JOIN 
    orderdetails od ON products.productCode = od.productCode
GROUP BY 
    products.productName, products.productLine, products.productVendor
HAVING 
    totalRevenue > 150000
ORDER BY
    totalRevenue DESC;

 * mysql+pymysql://root:***@localhost
6 rows affected.

[('1992 Ferrari 360 Spider red', 'Classic Cars', 'Unimax Art Galleries', Decimal('276839.98')),
 ('2001 Ferrari Enzo', 'Classic Cars', 'Second Gear Diecast', Decimal('190755.86')),
 ('1952 Alpine Renault 1300', 'Classic Cars', 'Classic Metal Creations', Decimal('190017.96')),
 ('2003 Harley-Davidson Eagle Drag Bike', 'Motorcycles', 'Red Start Diecast', Decimal('170686.00')),
 ('1968 Ford Mustang', 'Classic Cars', 'Autoart Studio Design', Decimal('161531.48')),
 ('1969 Ford Falcon', 'Classic Cars', 'Second Gear Diecast', Decimal('152543.02'))]

## SQL2

- Write a query that produces a table of form `(productCode, productName, productVendor, customerCount)`.
    - Attribute names should match exactly.
    - `customerCount` is the number of **distinct** customers that have bought the product.
        - Note that the same customer may buy a product multiple times. This only counts as one customer in the product's `customerCount`.
    - You should consider all orders, regardless of `status`.
- Order your table from largest to smallest `customerCount`, then on `productCode` alphabetically.
- Only show the first 10 rows.


- You should use the `orders` and `orderdetails` tables.

In [242]:
%%sql

SELECT 
    p.productCode,
    p.productName,
    p.productVendor, 
    COUNT(DISTINCT o.customerNumber) AS customerCount
FROM 
    products p
JOIN
    orderdetails od ON p.productCode = od.productCode
JOIN 
    orders o ON od.orderNumber = o.orderNumber
GROUP BY 
    p.productCode
ORDER BY 
    customerCount DESC, p.productCode ASC
LIMIT 10;

 * mysql+pymysql://root:***@localhost
10 rows affected.

[('S18_3232', '1992 Ferrari 360 Spider red', 'Unimax Art Galleries', 40),
 ('S10_1949', '1952 Alpine Renault 1300', 'Classic Metal Creations', 27),
 ('S10_4757', '1972 Alfa Romeo GTA', 'Motor City Art Classics', 27),
 ('S18_2957', '1934 Ford V8 Coupe', 'Min Lin Diecast', 27),
 ('S72_1253', 'Boeing X-32A JSF', 'Motor City Art Classics', 27),
 ('S10_1678', '1969 Harley Davidson Ultimate Chopper', 'Min Lin Diecast', 26),
 ('S10_2016', '1996 Moto Guzzi 1100i', 'Highway 66 Mini Classics', 26),
 ('S18_1662', '1980s Black Hawk Helicopter', 'Red Start Diecast', 26),
 ('S18_1984', '1995 Honda Civic', 'Min Lin Diecast', 26),
 ('S18_2949', '1913 Ford Model T Speedster', 'Carousel DieCast Legends', 26)]

## SQL3

- Write a query that produces a table of form `(customerName, month, year, monthlyExpenditure, creditLimit)`.
    - Attribute names should match exactly.
    - `monthlyExpenditure` is the total amount of payments made by a customer in a specific month and year based on the `payments` table.
        - Some customers have never made any payments ever. For these customers, `monthlyExpenditure` should be 0. `month` and `year` can be null.
- Only show rows where `monthlyExpenditure` exceeds `creditLimit` **or** the customer has never made any payments ever (so `month` and `year` should be null for these rows).
- Order your table on `monthlyExpenditure` descending, then on `customerName` alphabetically.
- Only show the first 10 rows.


- You should use the `payments` and `customers` tables.

In [239]:
%%sql

SELECT c.customerName, month(p.paymentDate) as month, year(p.paymentDate) as year, COALESCE(SUM(p.amount), 0) as monthlyExpenditure, c.creditLimit
FROM customers as c
LEFT JOIN payments as p ON p.customerNumber = c.customerNumber
GROUP BY c.customerNumber, month, year
HAVING monthlyExpenditure > c.creditLimit or monthlyExpenditure = 0
ORDER BY monthlyExpenditure DESC, customerName ASC
LIMIT 10;

 * mysql+pymysql://root:***@localhost
10 rows affected.

[('Dragon Souveniers, Ltd.', 12, 2003, Decimal('105743.00'), Decimal('103800.00')),
 ('American Souvenirs Inc', None, None, Decimal('0.00'), Decimal('0.00')),
 ('ANG Resellers', None, None, Decimal('0.00'), Decimal('0.00')),
 ('Anton Designs, Ltd.', None, None, Decimal('0.00'), Decimal('0.00')),
 ('Asian Shopping Network, Co', None, None, Decimal('0.00'), Decimal('0.00')),
 ('Asian Treasures, Inc.', None, None, Decimal('0.00'), Decimal('0.00')),
 ('BG&E Collectables', None, None, Decimal('0.00'), Decimal('0.00')),
 ('Cramer Spezialitäten, Ltd', None, None, Decimal('0.00'), Decimal('0.00')),
 ('Der Hund Imports', None, None, Decimal('0.00'), Decimal('0.00')),
 ('Feuer Online Stores, Inc', None, None, Decimal('0.00'), Decimal('0.00'))]

## SQL4

- Write a query that produces a table of form `(productCode, productName, productLine, productVendor, productDescription)`.
    - Attribute names should match exactly.
- **You should only keep products that have never been ordered by a French customer.**
    - You should consider all orders, regardless of `status`.
- Order your table on `productCode`.


- You should use the `customers`, `orders`, and `orderdetails` tables.

In [245]:
%%sql
SELECT 
    p.productCode, 
    p.productName, 
    p.productLine, 
    p.productVendor, 
    p.productDescription
FROM 
    products p
WHERE NOT EXISTS (
    SELECT *
    FROM orderdetails od
    JOIN orders o ON od.orderNumber = o.orderNumber
    JOIN customers c ON o.customerNumber = c.customerNumber
    WHERE p.productCode = od.productCode AND c.country = 'France'
)
ORDER BY p.productCode;

 * mysql+pymysql://root:***@localhost
2 rows affected.

[('S18_3233', '1985 Toyota Supra', 'Classic Cars', 'Highway 66 Mini Classics', 'This model features soft rubber tires, working steering, rubber mud guards, authentic Ford logos, detailed undercarriage, opening doors and hood, removable split rear gate, full size spare mounted in bed, detailed interior with opening glove box'),
 ('S18_4027', '1970 Triumph Spitfire', 'Classic Cars', 'Min Lin Diecast', 'Features include opening and closing doors. Color: White.')]

## SQL5

- A customer can have a sales rep employee.
- Corporate is deciding which employees to give raises to.
    - A raise is given for the reason `customers` if an employee has 8 or more customers.
    - A raise is given for the reason `orders` if the total number of orders made by customers associated with an employee is 30 or greater.
        - You should consider all orders, regardless of `status`.
    - A raise is given for the reason `both` if both conditions above are true.
- Write a query that produces a table of form `(firstName, lastName, totalCustomers, totalCustomerOrders, raiseBecause)`.
    - Attribute names should match exactly.
    - `firstName` and `lastName` are for the employee.
    - `totalCustomers` is the total number of customers associated with an employee.
    - `totalCustomerOrders` is the total number of orders made by customers associated with an employee.
    - `raiseBecause` is one of `customers`, `orders`, and `both`.
- Your table should only show employees eligible for raises, i.e., `raiseBecause` should not be null.
- Order your table on `firstName`.


- You should use the `customers`, `orders`, and `employees` tables.

In [235]:
%%sql

SELECT
    e.firstName,
    e.lastName,
    COUNT(DISTINCT c.customerNumber) AS totalCustomers,
    COUNT(o.orderNumber) AS totalCustomerOrders,
    CASE
        WHEN COUNT(DISTINCT c.customerNumber) >= 8 AND COUNT(o.orderNumber) >= 30 THEN 'both'
        WHEN COUNT(DISTINCT c.customerNumber) >= 8 THEN 'customers'
        WHEN COUNT(o.orderNumber) >= 30 THEN 'orders'
    END AS raiseBecause
FROM
    employees e
JOIN
    customers c ON e.employeeNumber = c.salesRepEmployeeNumber
JOIN
    orders o ON c.customerNumber = o.customerNumber
GROUP BY
    e.employeeNumber
HAVING
    totalCustomers >= 8 OR totalCustomerOrders >= 30
ORDER BY
    e.firstName;

 * mysql+pymysql://root:***@localhost
6 rows affected.

[('Barry', 'Jones', 9, 25, 'customers'),
 ('George', 'Vanauf', 8, 22, 'customers'),
 ('Gerard', 'Hernandez', 7, 43, 'orders'),
 ('Larry', 'Bott', 8, 22, 'customers'),
 ('Leslie', 'Jennings', 6, 34, 'orders'),
 ('Pamela', 'Castillo', 10, 31, 'both')]